pin_msg = '''
Приветствую, я - бот, созданный командой gostarters в рамках хакатона Atomic Hack 2.0.
Моей задачей является автоматическое выявление дефектов сварных швов по фотографиям.

Инструкция по классам, изображенных на фотографиях с дефектами:

➔ #adj
        ⤷ прилегающие дефекты:
                                · брызги
                                · прожоги от дуги
➔ #int
        ⤷ дефекты целостности:
                                · кратер
                                · шлак
                                · свищ
                                · пора
                                · прожог
                                · включения
➔ #geo
        ⤷ дефекты геометрии:
                                · подрез
                                · непровар
                                · наплыв
                                · чешуйчатость
                                · западание
                                · неравномерность
➔ #pro
        ⤷ дефекты постобработки:
                                · заусенец
                                · торец
                                · задир
                                · забоина
➔ #non
        ⤷ дефекты невыполнения:
                                · незаполнение раковины
                                · несплавление
'''

pin_info = '''
Я закрепил это сообщение, чтобы вы в любой момент могли найти инструкцию!
'''

wait_print_answ = '''
Дождитесь моего ответа...
'''

idk_text = '''
Извините, я вас не понимаю, воспринимаю только сообщения с фото, желательно сварных швов :)
'''

error = '''
ошибка(
'''


MESSAGES = {
    'pin_msg': pin_msg,
    'pin_info': pin_info,
    'wait_print_answ': wait_print_answ,
    'idk_text': idk_text,
    'error': error
}
